export const RETROSPECT_QUESTIONS = [
  {
    title: '1. 자신의 의견 대신 페어의 의견을 수용한 적이 있나요?',
    subtitle: '그 과정에서 무엇을 배웠고, 어떤 것을 느꼈나요?',
    id: '1',
  },
  {
    title: '2. 내 의견을 페어에게 효과적으로 설명하고 이해시켰나요?',
    subtitle: '의견 전달 과정에서 어려웠던 점은 무엇인가요?',
    id: '2',
  },
  {
    title: '3. 상대방의 코드를 이해하지 못한 때가 있었나요?',
    subtitle: '질문을 통해 모르는 부분에 대해 소통했나요? 새롭게 배운 내용을 적어 주셔도 좋아요.',
    id: '3',
  },
  {
    title: '4. 다음 페어 프로그래밍을 위해 내가 개선해야 할 점은 무엇인가요?',
    subtitle:
      '이번 페어 프로그래밍을 통해 아쉬웠던 점은 무엇이었나요? 혹은 다음 페어 프로그래밍에서 시도해보고 싶은 것이 있나요?',
    id: '4',
  },
  {
    title: '5. 페어 프로그래밍을 하면서 만족한 점이 있었나요?',
    subtitle: '다음 페어 프로그래밍 때도 이어나가고 싶은 점을 적어주세요!',
    id: '5',
  },
  {
    title: '6. 추가로 작성하고 싶은 내용이 있다면 자유롭게 작성해주세요!',
    subtitle: '느낀 점, 배운 것들... 어떤 내용이든 괜찮아요.',
    id: '6',
  },
];
