export const RETROSPECT_QUESTIONS = [
  {
    title: '1. 상대방의 코드 지적을 객관적으로 받아들일 수 있었나요?',
    subtitle: '특별히 받아들이기 어려웠던 피드백이 있었다면 무엇이었나요?',
    id: '1',
  },
  {
    title: '2. 코드나 개념을 이해하지 못했을 때 솔직하게 질문하셨나요?',
    subtitle: '이해하지 못한 채 넘어간 부분이 있다면 무엇이었나요?',
    id: '2',
  },
  {
    title: '3. 고집을 버리고 페어의 제안을 수용해본 경험이 있나요?',
    subtitle: '수용 후 어떤것을 배웠나요? 혹은 아쉬웠던 점은 무엇인가요?',
    id: '3',
  },
  {
    title: '4. 내 의견을 페어에게 효과적으로 설명하고 이해시켰나요?',
    subtitle: '의견 전달 과정에서 어려웠던 점은 무엇인가요?',
    id: '4',
  },
  {
    title: '5. 다음 페어 프로그래밍을 위해 내가 개선해야 할 점은 무엇인가요?',
    subtitle:
      '이번 페어프로그래밍을 통해 아쉬웠던 점은 무엇이었나요? 혹은 다음 페어 프로그래밍에서는 어떤 새로운 시도를 해보고 싶나요?',
    id: '5',
  },
  {
    title: '6. 페어프로그래밍을 하면서 만족한 부분이 있었나요?',
    subtitle: '다음 페어 프로그래밍 때도 이어나가고 싶은 부분을 적어주세요!',
    id: '6',
  },
  {
    title: '7. 기타',
    subtitle: '추가로 작성하고 싶은 게 있다면 자유롭게 작성해주세요!',
    id: '7',
  },
];
